docs/logs/04-ab-output.log
Benchmarking ecs-s-Front-1RSRXLTKZ2GVF-1072220086.us-west-2.elb.amazonaws.com (be patient)
Completed 150 requests
Completed 300 requests
Completed 450 requests
Completed 600 requests
Completed 750 requests
Completed 900 requests
Completed 1050 requests
Completed 1200 requests
Completed 1350 requests

Completed 1500 requests
Finished 1500 requests

Server Software:
Server Hostname:        ecs-s-Front-1RSRXLTKZ2GVF-1072220086.us-west-2.elb.amazonaws.com
Server Port:            80

Document Path:          /
Document Length:        33 bytes

Concurrency Level:      10
Time taken for tests:   17.589 seconds
Complete requests:      1500
Failed requests:        46
(Connect: 0, Receive: 0, Length: 46, Exceptions: 0)
Non-2xx responses:      46
Total transferred:      260492 bytes
HTML transferred:       55848 bytes
Requests per second:    85.28 [#/sec] (mean)
Time per request:       117.257 [ms] (mean)
Time per request:       11.726 [ms] (mean, across all concurrent requests)
Transfer rate:          14.46 [Kbytes/sec] received